Repository: thlabbe/sicp-fr
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: We can easily define a procedure sum-of-squares that, given any two numbers as arguments, produces the sum of their squares:
fr_fr: Nous pouvons facilement définir une procédure somme-de-carrés qui, avec deux nombres comme arguments, produira la somme de leurs carrés :

source: We can help ourselves by writing such an expression in the form
fr_fr: Nous pouvons nous faciliter la tâche en écrivant une telle expression sous la forme

source: We can obtain a picture of this process by representing the combination in the form of a tree, as shown in figure 1.1.
fr_fr: Nous pouvons obtenir une image de ce processus en représentant la combinaison sous la forme d'un arbre, comme dans la figure 1.1.

source: We can understand this in the following way:
fr_fr: Nous pouvons comprendre ceci de la manière suivante :

source: We have here a compound procedure, which has been given the name square.
fr_fr: Nous avons ici une procédure composée à qui le nom carré a été donnée.

source: We have identified in Lisp some of the elements that must appear in any powerful programming language:
fr_fr: Nous avons identifié dans Lisp quelques éléments qui doivent apparaitre dans n'importe quel langage de programmation puissant :

source: We may regard the second rule as a special case of the third one by stipulating that symbols such as + and * are also included in the global environment, and are associated with the sequences of machine instructions that are their ``values.'' The key point to notice is the role of the environment in determining the meaning of the symbols in expressions.
fr_fr: On peut considérer la seconde règle comme un cas particulier de la troisième en déclarant que les symboles tels que + et * sont aussi inclus dans l'environnement global et sont associés aux séquences d'instruction machine qui sont leurs « valeurs ». Le point clé à considérer est le rôle de l'environnement dans la détermination de la signification des symboles dans les expressions.

source: We must evaluate the operator to get the procedure to be applied, and we must evaluate the operands to get the arguments.
fr_fr: Nous devons évaluer l'opérateur pour que la procédure soit appliquée, et nous devons évaluer les opérandes pour obtenir les arguments.

source: We say that the name identifies a variable whose value is the object.
fr_fr: Nous disons que le nom identifie une variable dont la valeur est l'objet,

source: We take care of the primitive cases by stipulating that
fr_fr: Nous traitons les cas de primitives en stipulant que

source: We will discuss this more fully in chapters 3 and 4 when we examine the implementation of an interpreter in detail.
fr_fr: Nous aborderons ceci de manière plus approfondie dans les chapitres 3 et 4 quand nous examinerons l'implémentation d'un interpréteur en détail.

source: What is the result printed by the interpreter in response to each expression?
fr_fr: Quel est le résultat présenté par l'interpréteur en réponse à chacune de ces expressions ?

source: You type an expression, and the interpreter responds by displaying the result of its evaluating that expression.
fr_fr: Vous saisissez une expression et l'interpréteur répond en affichant le résultat de son évaluation de cette expressions.

source: [Go to first, previous, next page; contents; index]
fr_fr: [Aller à la première page, à la page précédente, suivante ; table des matières ; index]

source: and finally to
fr_fr: et finalement à

source: causes the interpreter to associate the value 2 with the name size.8 Once the name size has been associated with the number 2, we can refer to the value 2 by name:
fr_fr: fait associer à l'interpréteur la valeur 2 au nom taille.8 Une fois le nom taille associé au nombre 2, il est possible de faire référence à la valeur 2 à l'aide de son nom.

source: circumference
fr_fr: circonference

source: consisting of the symbol cond followed by parenthesized pairs of expressions (<p> <e>) called clauses.
fr_fr: qui consiste du symbole cond suivi par des paires d'expressions entre parenthèses (<p> <e>) appelées clauses.

source: followed by the reductions
fr_fr: suivie par les réductions

source: following a formatting convention known as pretty-printing, in which each long combination is written so that the operands are aligned vertically.
fr_fr: grâce à une convention d'impression élégante selon laquelle toute combinaison longue est écrite de manière à ce que les opérandes soient alignées verticalement.

source: foreword by Alan J. Perlis
fr_fr: Avant-propos de Alan J. Perlis

source: of Computer Programs
fr_fr: des programmes informatiques

source: or alternatively as
fr_fr: ou alternativement de cette manière

source: requires that the evaluation rule be applied to four different combinations.
fr_fr: demande que la règle d'évaluation soit appliquée à quatre combinaisons différentes.

source: second edition
fr_fr: Seconde édition

source: size
fr_fr: taille

source: the interpreter will respond by printing5
fr_fr: l'interpréteur répondra en affichant5

source: the values of built-in operators are the machine instruction sequences that carry out the corresponding operations, and
fr_fr: la valeur des opérateurs *** sont les séquences d'instruction machine qui effectuent l'opération correspondant, et

source: the values of numerals are the numbers that they name,
fr_fr: la valeur de numéraux est le nombre qu'ils représentent,

source: the values of other names are the objects associated with those names in the environment.
fr_fr: la valeur des autres noms est les objets associés à ces noms dans l'environnement.

source: where f is the procedure defined in section 1.1.4.
fr_fr: où f est la procédure définie en section 1.1.4.

source: which could be expressed in English as ``If x is less than zero return - x; otherwise return x.'' Else is a special symbol that can be used in place of the <p> in the final clause of a cond.
fr_fr: qui peut s'exprimer en français de la manière suivante : « si x est inférieur à zéro, retourne - x autrement retourne x. » Else est un symbole spécial qui peut être utilisé à la place de <p> dans la clause finale d'un cond.

source: which reduces by multiplication to
fr_fr: ce qui se réduit à

source: which the interpreter would readily evaluate to be 57.
fr_fr: que l'interpréteur aurait évalué immédiatement à 57.

source: with x replaced respectively by (+ 5 1) and (* 5 2).
fr_fr: avec x remplacé respectivement par (+ 5 1) et (*5 2).

source: with Julie Sussman
fr_fr: avec Julie Sussman

source: would proceed according to the sequence of expansions
fr_fr: se déroulerait selon la suite d'expansions
